Задача 2: Анализ данных о продажах
Описание:
У вас есть DataFrame с данными о продажах. В таблице содержатся следующие столбцы:
Product — название продукта.
Quantity — количество проданных единиц.
Price — цена за единицу продукта.
Задачи:
Загрузите данные в DataFrame.
Добавьте столбец Total, который будет содержать общую выручку за каждый продукт (количество * цену).
Найдите общую выручку от всех продаж.
Выведите список продуктов, у которых количество проданных единиц больше 50.

In [8]:
data = {
    'Product': ['Apple', 'Banana', 'Orange', 'Milk', 'Bread'],
    'Quantity': [100, 80, 60, 40, 90],
    'Price': [1.0, 0.5, 0.8, 2.5, 1.2]
}

In [9]:
import pandas as pd
import pandasql as ps

df = pd.DataFrame(data)
df['Total'] = df['Quantity'] * df['Price']
df

  Product  Quantity  Price  Total
0   Apple       100    1.0  100.0
1  Banana        80    0.5   40.0
2  Orange        60    0.8   48.0
3    Milk        40    2.5  100.0
4   Bread        90    1.2  108.0

In [10]:
query = "SELECT SUM(Total) FROM df"

result = ps.sqldf(query)
result

   SUM(Total)
0       396.0

In [12]:
query = "SELECT Product, Quantity FROM df WHERE Quantity > 50"

result = ps.sqldf(query)
result

  Product  Quantity
0   Apple       100
1  Banana        80
2  Orange        60
3   Bread        90